Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/atdf/PIC32CZ2051CA90208S1.atdf
        <register name="ENAL" offset="0x10" rw="RW" size="4" atomic-op="set:ENAL" initval="0x00000000" caption="Interrupt Enable Register Low">
          <bitfield name="RTC" caption="RTC Interrupt" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt" mask="0x2"/>
          <bitfield name="EXTDMA" caption="External DMA Interrupt" mask="0x4"/>
          <bitfield name="WDOG" caption="Watch Dog Interrupt" mask="0x8"/>
          <bitfield name="TAMPER_BUSY" caption="Tamper Busy Interrupt" mask="0x20"/>
          <bitfield name="TIMER0" caption="Timer 0 Interrupt" mask="0x40"/>
          <bitfield name="TIMER1" caption="Timer 1 interrupt" mask="0x80"/>
          <bitfield name="PWRDOWN" caption="Power Down Interrupt" mask="0x800"/>
          <bitfield name="MB_TX" caption="Mailbox TX Interrupt" mask="0x4000"/>
          <bitfield name="MB_RX" caption="Mailbox RX Interrupt" mask="0x8000"/>
          <bitfield name="CRYPTO0" caption="Crypto Interrupt 0" mask="0x10000"/>
          <bitfield name="CRYPTO1" caption="Crypto Interrupt 1" mask="0x20000"/>
          <bitfield name="CRYPTO2" caption="Crypto Interrupt 2" mask="0x40000"/>
          <bitfield name="CRYPTO3" caption="Crypto Interrupt 3" mask="0x80000"/>
        </register>
        <register name="CLRL" offset="0x18" rw="W" size="4" atomic-op="clear:CLRL" initval="0x00000000" caption="Interrupt Disable Register Low">
          <bitfield name="RTC" caption="RTC Interrupt" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt" mask="0x2"/>
          <bitfield name="EXTDMA" caption="External DMA Interrupt" mask="0x4"/>
          <bitfield name="WDOG" caption="Watch Dog Interrupt" mask="0x8"/>
          <bitfield name="TAMPER_BUSY" caption="Tamper Busy Interrupt" mask="0x20"/>
          <bitfield name="TIMER0" caption="Timer 0 Interrupt" mask="0x40"/>
          <bitfield name="TIMER1" caption="Timer 1 interrupt" mask="0x80"/>
          <bitfield name="PWRDOWN" caption="Power Down Interrupt" mask="0x800"/>
          <bitfield name="MB_TX" caption="Mailbox TX Interrupt" mask="0x4000"/>
          <bitfield name="MB_RX" caption="Mailbox RX Interrupt" mask="0x8000"/>
          <bitfield name="CRYPTO0" caption="Crypto Interrupt 0" mask="0x10000"/>
          <bitfield name="CRYPTO1" caption="Crypto Interrupt 1" mask="0x20000"/>
          <bitfield name="CRYPTO2" caption="Crypto Interrupt 2" mask="0x40000"/>
          <bitfield name="CRYPTO3" caption="Crypto Interrupt 3" mask="0x80000"/>
        </register>
        <register name="TSTL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Interrupt Test Source Register Low">
          <bitfield name="RTC" caption="RTC Interrupt" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt" mask="0x2"/>
          <bitfield name="EXTDMA" caption="External DMA Interrupt" mask="0x4"/>
          <bitfield name="WDOG" caption="Watch Dog Interrupt" mask="0x8"/>
          <bitfield name="TAMPER_BUSY" caption="Tamper Busy Interrupt" mask="0x20"/>
          <bitfield name="TIMER0" caption="Timer 0 Interrupt" mask="0x40"/>
          <bitfield name="TIMER1" caption="Timer 1 interrupt" mask="0x80"/>
          <bitfield name="PWRDOWN" caption="Power Down Interrupt" mask="0x800"/>
          <bitfield name="MB_TX" caption="Mailbox TX Interrupt" mask="0x4000"/>
          <bitfield name="MB_RX" caption="Mailbox RX Interrupt" mask="0x8000"/>
          <bitfield name="CRYPTO0" caption="Crypto Interrupt 0" mask="0x10000"/>
          <bitfield name="CRYPTO1" caption="Crypto Interrupt 1" mask="0x20000"/>
          <bitfield name="CRYPTO2" caption="Crypto Interrupt 2" mask="0x40000"/>
          <bitfield name="CRYPTO3" caption="Crypto Interrupt 3" mask="0x80000"/>
        </register>
        <register name="SELL" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Interrupt Source Selection Register Low">
          <bitfield name="RTC" caption="RTC Interrupt" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt" mask="0x2"/>
          <bitfield name="EXTDMA" caption="External DMA Interrupt" mask="0x4"/>
          <bitfield name="WDOG" caption="Watch Dog Interrupt" mask="0x8"/>
          <bitfield name="TAMPER_BUSY" caption="Tamper Busy Interrupt" mask="0x20"/>
          <bitfield name="TIMER0" caption="Timer 0 Interrupt" mask="0x40"/>
          <bitfield name="TIMER1" caption="Timer 1 interrupt" mask="0x80"/>
          <bitfield name="PWRDOWN" caption="Power Down Interrupt" mask="0x800"/>
          <bitfield name="MB_TX" caption="Mailbox TX Interrupt" mask="0x4000"/>
          <bitfield name="MB_RX" caption="Mailbox RX Interrupt" mask="0x8000"/>
          <bitfield name="CRYPTO0" caption="Crypto Interrupt 0" mask="0x10000"/>
          <bitfield name="CRYPTO1" caption="Crypto Interrupt 1" mask="0x20000"/>
          <bitfield name="CRYPTO2" caption="Crypto Interrupt 2" mask="0x40000"/>
          <bitfield name="CRYPTO3" caption="Crypto Interrupt 3" mask="0x80000"/>
        </register>
        <register name="APRL" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Interrupt Activation Polarity Register Low">
          <bitfield name="RTC" caption="RTC Interrupt" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt" mask="0x2"/>
          <bitfield name="EXTDMA" caption="External DMA Interrupt" mask="0x4"/>
          <bitfield name="WDOG" caption="Watch Dog Interrupt" mask="0x8"/>
          <bitfield name="TAMPER_BUSY" caption="Tamper Busy Interrupt" mask="0x20"/>
          <bitfield name="TIMER0" caption="Timer 0 Interrupt" mask="0x40"/>
          <bitfield name="TIMER1" caption="Timer 1 interrupt" mask="0x80"/>
          <bitfield name="PWRDOWN" caption="Power Down Interrupt" mask="0x800"/>
          <bitfield name="MB_TX" caption="Mailbox TX Interrupt" mask="0x4000"/>
          <bitfield name="MB_RX" caption="Mailbox RX Interrupt" mask="0x8000"/>
          <bitfield name="CRYPTODMA" caption="Crypto DMA Interrupt" mask="0x10000"/>
          <bitfield name="NDRNG" caption="RNG Interrupt" mask="0x20000"/>
          <bitfield name="PKENGINE" caption="PK Engine Interrupt" mask="0x40000"/>
        </register>
        <register name="ATRL" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="Interrupt Activation Type Register Low">
          <bitfield name="RTC" caption="RTC Interrupt" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt" mask="0x2"/>
          <bitfield name="EXTDMA" caption="External DMA Interrupt" mask="0x4"/>
          <bitfield name="WDOG" caption="Watch Dog Interrupt" mask="0x8"/>
          <bitfield name="TAMPER_BUSY" caption="Tamper Busy Interrupt" mask="0x20"/>
          <bitfield name="TIMER0" caption="Timer 0 Interrupt" mask="0x40"/>
          <bitfield name="TIMER1" caption="Timer 1 interrupt" mask="0x80"/>
          <bitfield name="PWRDOWN" caption="Power Down Interrupt" mask="0x800"/>
          <bitfield name="MB_TX" caption="Mailbox TX Interrupt" mask="0x4000"/>
          <bitfield name="MB_RX" caption="Mailbox RX Interrupt" mask="0x8000"/>
          <bitfield name="CRYPTO0" caption="Crypto Interrupt 0" mask="0x10000"/>
          <bitfield name="CRYPTO1" caption="Crypto Interrupt 1" mask="0x20000"/>
          <bitfield name="CRYPTO2" caption="Crypto Interrupt 2" mask="0x40000"/>
          <bitfield name="CRYPTO3" caption="Crypto Interrupt 3" mask="0x80000"/>
        </register>
