Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/atdf/PIC32CZ2051CA90208S1.atdf
        <register name="ITRL" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Interrupt Type register Low">
          <bitfield name="RTC" caption="RTC Interrupt" mask="0x1"/>
          <bitfield name="TAMPER" caption="Tamper Interrupt" mask="0x2"/>
          <bitfield name="EXTDMA" caption="External DMA Interrupt" mask="0x4"/>
          <bitfield name="WDOG" caption="Watch Dog Interrupt" mask="0x8"/>
          <bitfield name="TAMPER_BUSY" caption="Tamper Busy Interrupt" mask="0x20"/>
          <bitfield name="TIMER0" caption="Timer 0 Interrupt" mask="0x40"/>
          <bitfield name="TIMER1" caption="Timer 1 interrupt" mask="0x80"/>
          <bitfield name="PWRDOWN" caption="Power Down Interrupt" mask="0x800"/>
          <bitfield name="MB_TX" caption="Mailbox TX Interrupt" mask="0x4000"/>
          <bitfield name="MB_RX" caption="Mailbox RX Interrupt" mask="0x8000"/>
          <bitfield name="CRYPTO0" caption="Crypto Interrupt 0" mask="0x10000"/>
          <bitfield name="CRYPTO1" caption="Crypto Interrupt 1" mask="0x20000"/>
          <bitfield name="CRYPTO2" caption="Crypto Interrupt 2" mask="0x40000"/>
          <bitfield name="CRYPTO3" caption="Crypto Interrupt 3" mask="0x80000"/>
        </register>
        <register name="PIN" offset="0x48" rw="R" size="4" initval="0x00000000" caption="Interrupt Pending IRQ Num">
          <bitfield name="PIN" caption="Pending IRQ Num" mask="0x3F"/>
        </register>
      </register-group>
    </module>
    <module name="MAILBOX" version="1.0.0" caption="eSecure MailBox Module">
      <register-group name="MAILBOX" caption="eSecure MailBox Module">
        <register name="FIFO" offset="0x0" rw="RW" ocd-rw="" size="4" count="16" caption="Mailbox FIFO">
          <bitfield name="Data" caption="Mailbox data" mask="0xFFFFFFFF"/>
        </register>
        <register name="TX_STATUS" offset="0x40" rw="R" size="4" caption="Transmit Status">
          <bitfield name="TXREMAINING" caption="Transmit Bytes Remaining" mask="0xFFFF"/>
          <bitfield name="TXTYPE" caption="Message Type" mask="0xF0000"/>
          <bitfield name="TXINT" caption="Transmit Interrupt" mask="0x100000"/>
          <bitfield name="TXFULL" caption="Transmit FIFO Full" mask="0x200000"/>
          <bitfield name="TXERROR" caption="Transmit Error" mask="0x800000"/>
        </register>
        <register name="RX_STATUS" offset="0x44" rw="R" size="4" caption="Receive Status">
          <bitfield name="RXREMAINING" caption="Receive Bytes Remaining" mask="0xFFFF"/>
          <bitfield name="RXTYPE" caption="Receive Message Type" mask="0xF0000"/>
          <bitfield name="RXINT" caption="Receive Interrupt Occurred" mask="0x100000"/>
          <bitfield name="RXEMPTY" caption="Receive FIFO Empty" mask="0x200000"/>
          <bitfield name="RXHEADER" caption="Receive Header" mask="0x400000"/>
          <bitfield name="RXERROR" caption="Receive Error" mask="0x800000"/>
        </register>
        <register name="TX_PROT" offset="0x48" rw="R" size="4" caption="Transmit Protect">
          <bitfield name="UNPROT" caption="Mailbox Message Unprotected" mask="0x200000"/>
          <bitfield name="PRIV" caption="Mailbox message Privilaged" mask="0x400000"/>
          <bitfield name="NSEC" caption="Mailbox Message Unsecured" mask="0x800000"/>
          <bitfield name="USER" caption="User bits" mask="0xFF000000"/>
        </register>
        <register name="RX_PROT" offset="0x4C" rw="R" size="4" caption="Receieve Protect">
          <bitfield name="UNPROTECT" caption="Mailbox Message Unprotected" mask="0x200000"/>
          <bitfield name="PRIV" caption="Mailbox message Privilaged" mask="0x400000"/>
          <bitfield name="NSEC" caption="Mailbox Message Unsecured" mask="0x800000"/>
          <bitfield name="USER" caption="User bits" mask="0xFF000000"/>
        </register>
        <register name="TX_HEADER" offset="0x50" rw="W" ocd-rw="" size="4" caption="Transmit Header">
          <bitfield name="MSGSIZE" caption="Message Size" mask="0xFFFF"/>
          <bitfield name="MSGINFO" caption="Message Info" mask="0xF0000"/>
          <bitfield name="UNPROT" caption="Unprotected Access" mask="0x200000"/>
          <bitfield name="PRIV" caption="Privilaged Access" mask="0x400000"/>
          <bitfield name="NSEC" caption="Non Secure Access" mask="0x800000"/>
          <bitfield name="USER" caption="User Bits" mask="0xFF000000"/>
        </register>
        <register name="RX_HEADER" offset="0x54" rw="R" ocd-rw="" size="4" caption="Receive Header">
          <bitfield name="MSGSIZE" caption="Message Size" mask="0xFFFF"/>
          <bitfield name="MSGINFO" caption="Message Information" mask="0xF0000"/>
          <bitfield name="UNPROT" caption="Unprotected Access" mask="0x200000"/>
        </register>
        <register name="CONFIG" offset="0x58" rw="RW" size="4" caption="Configuration">
          <bitfield name="TX_INT_ENABLE" caption="Transmit Interrupt Enable" mask="0x1"/>
          <bitfield name="RX_INT_ENABLE" caption="Receive Interrupt Enable" mask="0x2"/>
        </register>
      </register-group>
    </module>
    <module name="MCRAMC" id="drm_mcramc_v3" name2="drm_mcramc_v3" version="3a0" caption="Multi-Channel RAM Controller Module">
      <register-group name="MCRAMC" caption="Multi-Channel RAM Controller Module">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000002" caption="Control Enable A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CTRLA__SWRST"/>
          <bitfield name="ENABLE" caption="ECC Decoder Enable" mask="0x2" values="CTRLA__ENABLE"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Sync Busy Register">
          <bitfield name="SWRST" caption="Software reset busy bit" mask="0x1"/>
          <bitfield name="FLTEN" caption="Fault Injection Enabled busy bit" mask="0x2"/>
          <bitfield name="ENABLE" caption="ECC Decoder Enable busy bit" mask="0x4"/>
        </register>
